Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: muhogo
en: Cassava

source: ubuhunga bwa muhogo
en: Cassava flour

source: ebikora bya muhogo
en: Cassava leaves

source: tulima muhogo mumusiri gwaitu
en: We grow cassava in our garden

source: muhogo kyokulya kyamunuka mu bunyoro
en: Cassava is a staple food in Bunyoro

source: omuceri
en: Rice

source: tucumba omuceri buli kiro
en: We cook rice every day

source: omuceri gukura mukyeya
en: Rice grows in wetlands

source: omuhendo gwo'muceri gweyongire
en: The price of rice has increased

source: ekiyuni
en: Yam

source: ebiyuni babigesa omukyanda
en: Yams are harvested in the dry season

source: ekikeke
en: Pumpkin

source: ebikora bye'bikeke babirya
en: Pumpkin leaves are edible

source: tubyara ebikeke haihi no'rugo
en: We planted pumpkins near the fence

source: kugesa
en: Harvesting

source: nitugesa ebicoli kiro kinu
en: We are harvesting maize today

source: amagesa gabaire marungi omwaka gunu
en: The harvest was good this year

source: hanyuma yo'kugesa twahura esingo
en: After harvesting we store the grain

source: akasumi kokugesa kaba kasumi kokusemererwa
en: Harvest time is a time of joy

source: okusesira ebirimwa amaizi goruseke
en: Irrigation

source: okusesira ebirimwa amaizi goruseke kiyambaho ebirimwa kukura omukasumi ke'kyanda
en: Irrigation helps crops grow in dry season

source: abalimi bakozesa okusesira ebirimwa amaizi omumisiri yabo
en: The farmers use irrigation to water their fields

source: okurimira
en: Plowing

source: turimira omusiri tutakabyaire
en: We plow the field before planting

source: etrakita ikozesibwa okurimira
en: The tractor is used for plowing

source: okusiga
en: Sowing

source: tusiga embibo omutandikwa ye'njura
en: We sow seeds at the beginning of the rainy season

source: okusiga kukorwa hanyuma yo'kulima
en: Sowing is done after plowing

source: okugesa
en: Reaping

source: abalimi nibagesa oburo
en: The farmers are reaping millet

source: okugesa kukolebya hanyuma ye'bimera byezire
en: Reaping is done when the crop is mature

source: okusegesa
en: Threshing

source: tusegesa oburo okubaganizamu esingo
en: We thresh millet to separate the grain

source: okusegesa mulimo gugumire
en: Threshing is hard work

source: okusalira
en: Pruning

source: tusalira omwani nukyo twongeze amagesa
en: We prune coffee trees to increase yield

source: okusalira kiyambaho ebirimwa kukura kurungi
en: Pruning helps the plant grow better

source: okwombera
en: Weeding

source: twombera omusiri buli wiiki
en: We weed the garden every week

source: okwombera kwihamu ebisaka ebtakwetagibya mumusiri
en: Weeding removes unwanted plants

source: enkoko
en: Chicken

source: tulinda enkoko omuka
en: We keep chickens at home

source: enkoko zalika amahuli bulikiro
en: The chicken lays eggs every day

source: enkoko zirya esingo ne'bihuka
en: Chickens eat grain and insects

source: akame
en: Rabbit

source: tulinda obume habye'nyama
en: We raise rabbits for meat

source: enyama yo'bume erimu ebirisa
en: Rabbit meat is nutritious

source: okukama
en: Milking

source: tukama ente buli nyenkyakara
en: We milk the cows every morning

source: okukama kukorebya emirundi ebiri omu kiro
en: Milking is done twice a day

source: amata marungi hali abana abato
en: Fresh milk is good for children

source: ebifu by'ebimera
en: Compost

source: ebifu by'ebimera biyongera orwezo mwitaka
en: Compost improves soil fertility

source: tukora ebifu by'ebimera okuruga mubifu byebimera
en: We make compost from plant waste

source: orwezo
en: Manure

source: obusa bw'ente rwezo rurungi
en: Cow manure is good fertilizer

source: tumasa orwezo omumusiri
en: We spread manure on the garden

source: orwezo ruhindura itaka
en: Manure improves soil quality

source: enjura
en: Rainfall

source: enjura enungi eba nungi muno hali abalimi
en: Good rainfall is important for farming

source: enjura sizoni enu ebaire mbi
en: The rainfall this season was poor

source: ebirimwa nibyenda enjura ekumara kukura
en: Crops need enough rainfall to grow

source: efuka
en: Hoe

source: efuka kikwatwa kikuru mukulima
en: The hoe is the main farming tool

source: tukozesa efuka kulima omusiri
en: We use a hoe to dig the garden

source: efuka etweire eyorobya omulimo
en: A sharp hoe makes work easier

source: ekisalizo
en: Machete

source: tukozesa ekisalizo okuhunjya ekisaka
en: We use a machete to clear the bush

source: ekisalizo kikozesibwa okusara emikonde ye'bitoke
en: The machete is used to cut banana stems

source: enaijoro
en: Sickle

source: tukozesa enaijoro okugesa oburo
en: We use a sickle to harvest millet

source: enengere
en: Wheelbarrow

source: tukozesa enengere okuhimba itaka
en: We use a wheelbarrow to carry soil

source: enengere ehimba emigugu ekuremera
en: The wheelbarrow carries heavy loads

source: kutunda aheru yihanga
en: Export

source: uganda etunda omwani mumahanga maingi
en: Uganda exports coffee to many countries

source: okutunda omwani aheru yihanga kireta sente hali abalimi
en: Coffee export brings money to farmers

source: ekitebe ky'abalimi
en: Cooperative

source: abalimi bataha mukitebe nukwo batundire hamu
en: Farmers join cooperatives to sell together

source: abe'bitebe bagura ebicoli hali abalimi
en: The cooperative buys maize from farmers

source: oburo
en: Millet

source: tulima oburo omumisiri yaitu
en: We grow millet in our fields

source: oburo babukozesa okukora tonto
en: Millet is used to make local beer

source: obusera byo'buro bwine ekirisa
en: Millet porridge is nutritious

source: omugusa
en: Sorghum

source: omugusa tiguhura ekyanda
en: Sorghum is drought resistant

source: omwani
en: Coffee

source: omwani kirimwa kya sente ekyomugaso muno mu uganda
en: Coffee is an important cash crop in Uganda

source: tugesa omwani kabiri omumwaka
en: We harvest coffee twice a year

source: ebiiti bwomwani nibyetaga kubisalira
en: Coffee trees need pruning

source: ebinyobwa
en: Groundnut

source: ebinyobwa bine potaini nyingi
en: Groundnuts are rich in protein

source: tubyara ebinyobwa hanyuma ye'njura
en: We plant groundnuts after the rains

source: awutu ye'binyobwa bagikozesa kucumba
en: Groundnut oil is used for cooking

source: ebitakuli
en: Sweet potato

source: ebitakuli bikura kurungi omwitaka ryo'mumusenyi
en: Sweet potatoes grow well in sandy soil

source: tugesa ebitakuli hanyuma ya'mezi asaatu
en: We harvest sweet potatoes after three months

source: ebilaya
en: Potato

source: ebilaya babibyara omurwere
en: Potatoes are grown in highland areas

source: tutogosa ebilaya habwe'kulya
en: We boil potatoes for food

source: ente
en: Cattle

source: ente nungi muno mukulinda ebisoro mu bunyoro
en: Cattle are important livestock in Bunyoro

source: turiisa ente habe'nyama n'amata
en: We keep cattle for milk and meat

source: ente ziriisibya omu rwere
en: Cattle graze in the fields

source: empunu
en: Pig

source: turiisa empunu habye'nyama
en: We keep pigs for meat

source: empunu ziriya ebisigirwe byo'mukicumbiro
en: Pigs eat kitchen waste

source: okulinda empunu kirimu amagoba
en: Pig farming is profitable

source: okuriisa ente za'mata
en: Dairy farming

source: okuriisa ente za'mata kireta sente omumaka
en: Dairy farming provides income for families

source: ente zamata zikamwa amata maingi
en: Dairy cows produce a lot of milk

source: okutwara itaka
en: Soil erosion

source: okutwara itaka kisisa emisiri
en: Soil erosion destroys farmland

source: emiiti etangira okutwarwa kwitaka
en: Trees prevent soil erosion

source: omuwendo
en: Price

source: omuwendo gw'ebicooli gugezire haiguru
en: The price of maize has gone up

source: abalimi betoimbaita habwemihendo okuba hansi
en: Farmers complain about low prices

source: kutunda /kuguza
en: Sell

source: abalimi batunda/bakaguza ebiriimwa byabo omu katale
en: Farmers sell their produce at the market

source: tutunda/tukaguza ebitooke buli wiiki
en: We sell bananas every week

source: okugura
en: Buy

source: tugura embibo kuruga mukitebe
en: We buy seeds from the cooperative

source: gavumenti egura esingo hali abalimi
en: The government buys grain from farmers

source: aba
en: [GENERAL_PRON] who, of, these, for

source: abaanyu
en: [GENERAL_NOUN] someone's relatives

source: abuuka
en: [GENERAL_VERB] to rise quick ly

source: abuurra
en: [GENERAL_VERB] to undo, unfasten

source: abagomborozi
en: [GENERAL_NOUN] sub county chiefs

source: abange
en: [GENERAL_NOUN] mine

source: abamasaza
en: [GENERAL_NOUN] county chiefs

source: abatongole
en: [GENERAL_NOUN] sub-parish chiefs

source: abemiruka
en: [GENERAL_NOUN] parish chiefs

source: agange
en: [GENERAL_NOUN] mine

source: agutamba
en: [GENERAL_NOUN] he who relieves distress

source: aguurra
en: [GENERAL_VERB] to thin out seedlings

source: aheeru
en: [GENERAL_ADV] adv., out, outside

source: aheeru ya
en: [GENERAL_NOUN] wait for

source: aho
en: [GENERAL_NOUN] there

source: abonaaho
en: [GENERAL_NOUN] immediately, at once

source: ahukaniza
en: [GENERAL_VERB] to separate, divide, differentiate

source: ahuza
en: [GENERAL_NOUN] entrust with

source: abukana
en: [GENERAL_VERB] to part from

source: ahonaaho
en: [GENERAL_ADV] at that very moment

source: akaamuje
en: [COMMON_ANIMALS_NOUN] squirrel

source: bukamuje
en: [COMMON_ANIMALS_NOUN_PLURAL] squirrels

source: ahanyima
en: [GENERAL_NOUN] indicating sequence of events

source: hamwango
en: [COMMON_ANIMALS_NOUN] eagle

source: obwango
en: [COMMON_ANIMALS_NOUN_PLURAL] eagles

source: akagemo
en: [GENERAL_NOUN] force,compulsion

source: obugemo
en: [GENERAL_NOUN_PLURAL] force,compulsions

source: haiguru mubicuu
en: [GENERAL_ADV] up in the sky

source: akagirita
en: [GENERAL_NOUN] razor blade,shaving blade

source: obugirita
en: [GENERAL_NOUN_PLURAL] razor blade,shaving blades

source: akagobo
en: [GENERAL_NOUN] win in a game

source: obugoba
en: [GENERAL_NOUN_PLURAL] win in a games

source: akasumi kataito
en: [GENERAL_NOUN] shortest period of time

source: obusumi butaito
en: [GENERAL_NOUN_PLURAL] shortest period of times

source: ekyeeya
en: [GENERAL_NOUN] a type of swamp

source: ebyeeya
en: [GENERAL_NOUN_PLURAL] type of swamps

source: akabwegura
en: [COMMON_ANIMALS_NOUN] a small caterpillar

source: ebibwegura
en: [COMMON_ANIMALS_NOUN_PLURAL] small caterpillars

source: akahooho
en: [GENERAL_NOUN] nice scent

source: obuhoho
en: [GENERAL_NOUN_PLURAL] nice scents

source: akababagazi
en: [GENERAL_NOUN] initial stage of flowering

source: obubabagazi
en: [GENERAL_NOUN_PLURAL] initial stage of flowerings

source: akahuna
en: [GENERAL_NOUN] silence due to suprise

source: obuhuna
en: [GENERAL_NOUN_PLURAL] silence due to suprises

source: omunya
en: [COMMON_ANIMALS_NOUN] small lizard-like animal

source: eminya
en: [COMMON_ANIMALS_NOUN_PLURAL] small lizard-like animals

source: akabubi
en: [GENERAL_NOUN] hymen: vagina membrane

source: emibibi
en: [GENERAL_NOUN_PLURAL] hymen: vagina membranes

source: akaimeeme
en: [GENERAL_NOUN] end of breastbone

source: obwimeeme
en: [GENERAL_NOUN_PLURAL] end of breastbones

source: akaburyo
en: [GENERAL_NOUN] hillock: small hill

source: obuburyo
en: [GENERAL_NOUN_PLURAL] hillock: small hills

source: kahumizi
en: [COMMON_ANIMALS_NOUN] sparrow-hawk

source: obuhumizi
en: [COMMON_ANIMALS_NOUN_PLURAL] sparrow-hawks

source: akakorwa
en: [GENERAL_NOUN] weasel

source: obukorwa
en: [GENERAL_NOUN_PLURAL] weasels

source: akacancabari
en: [GENERAL_NOUN] rags:an old torn cloth

source: obucancabari
en: [GENERAL_NOUN_PLURAL] rags:an old torn cloths

source: akasengijo
en: [GENERAL_NOUN] a sieve

source: obusengijo
en: [GENERAL_NOUN_PLURAL] sieves

source: enkojo
en: [GENERAL_NOUN] blemish

source: ekitengo
en: [GENERAL_NOUN] a very old cloth

source: ebitengo
en: [GENERAL_NOUN_PLURAL] very old cloths

source: akaina/ekina
en: [GENERAL_NOUN] hole,small

source: obwina/ebina
en: [GENERAL_NOUN_PLURAL] hole,smalls

source: ekihuguhugu
en: [COMMON_ANIMALS_NOUN] bat: a flying mammal

source: ebihuguhugu
en: [COMMON_ANIMALS_NOUN_PLURAL] bat: a flying mammals

source: emboro
en: [GENERAL_NOUN] penis

source: ekika kye'njoka
en: [COMMON_ANIMALS_NOUN] a type of snake

source: ebika bye'njoka
en: [COMMON_ANIMALS_NOUN_PLURAL] type of snakes

source: kihinguraniza
en: [GENERAL_NOUN] something done excessively

source: bihinguraniza
en: [GENERAL_NOUN_PLURAL] something done excessivelies

source: akadebe
en: [GENERAL_NOUN] pail or bucket

source: edebe
en: [GENERAL_NOUN_PLURAL] pail or buckets

source: akafunjo
en: [GENERAL_NOUN] cyperus papyrus

source: ebifunjo
en: [GENERAL_NOUN_PLURAL] cyperus papyruses

source: akairima
en: [GENERAL_NOUN] darkness

source: omwirima
en: [GENERAL_NOUN_PLURAL] darknesses

source: akairiringwa
en: [NATURE_AND_ENVIRONMENT_NOUN] whirlwind

source: obwiriringwa
en: [NATURE_AND_ENVIRONMENT_NOUN_PLURAL] whirlwinds

source: akagoroda
en: [GENERAL_NOUN] bungle: a bracelet

source: obugoroda
en: [GENERAL_NOUN_PLURAL] bungle: a bracelets

source: akagwe
en: [GENERAL_NOUN] calamity: unexpected bad situation

source: obugwe
en: [GENERAL_NOUN_PLURAL] calamity: unexpected bad situations

source: akairirizi
en: [GENERAL_NOUN] twilight,dusk

source: obwiririzi
en: [GENERAL_NOUN_PLURAL] twilight,dusks

source: akagenda-kahiire
en: [COMMON_ANIMALS_NOUN]. A brownish grasshopper

source: obugenda-buhiire
en: [COMMON_ANIMALS_NOUN_PLURAL]. A brownish grasshoppers

source: akairukairukaine
en: [GENERAL_NOUN] chaos

source: obwirukairukaine
en: [GENERAL_NOUN_PLURAL] chaoses

source: empaka
en: [GENERAL_NOUN] competetion for something

source: akaisikina
en: [GENERAL_NOUN] hiccup

source: obwisikina
en: [GENERAL_NOUN_PLURAL] hiccups

source: akahimba
en: [GENERAL_NOUN] clitoris

source: obuhimba
en: [GENERAL_NOUN_PLURAL] clitorises

source: akahoiho
en: [COMMON_ANIMALS_NOUN] a small moth

source: obuhoiho
en: [COMMON_ANIMALS_NOUN_PLURAL] small moths

source: akaisikondo
en: [GENERAL_NOUN] hiccup

source: obwisikondo
en: [GENERAL_NOUN_PLURAL] hiccups

source: akahungabeebe
en: [COMMON_ANIMALS_NOUN] a small flying termite

source: obuhangabeebe
en: [COMMON_ANIMALS_NOUN_PLURAL] small flying termites

source: akajoogo
en: [GENERAL_NOUN] contempt

source: obujoogo
en: [GENERAL_NOUN_PLURAL] contempts

source: akajugo
en: [GENERAL_NOUN] a pen cover

source: obujugo
en: [GENERAL_NOUN_PLURAL] pen covers

source: akajunde
en: [GENERAL_NOUN] stench: an unpleasant smell

source: obujunde
en: [GENERAL_NOUN_PLURAL] stench: an unpleasant smells

source: akakiro
en: [GENERAL_NOUN] a small hillock

source: obukiro
en: [GENERAL_NOUN_PLURAL] small hillocks

source: akaizigorro
en: [GENERAL_NOUN] dizziness

source: obwizigorro
en: [GENERAL_NOUN_PLURAL] dizzinesses

source: akajabago
en: [GENERAL_NOUN] a muddy area

source: obujabago
en: [GENERAL_NOUN_PLURAL] muddy areas

source: akanuriirizi
en: [GENERAL_NOUN] sweet taste

source: obunuriirizi
en: [GENERAL_NOUN_PLURAL] sweet tastes

source: akajabirro
en: [GENERAL_NOUN] over excitement

source: obujabirro
en: [GENERAL_NOUN_PLURAL] over excitements

source: akajagarro
en: [GENERAL_NOUN] commotion

source: obujagarro
en: [GENERAL_NOUN_PLURAL] commotions

source: kwinganiza
en: [GENERAL_VERB] to level, flat

source: kujarra
en: [GENERAL_VERB] to spread for

source: kwija
en: [GENERAL_VERB] to come

source: alimansr
en: [GENERAL_NOUN] diamond

source: tandika
en: [GENERAL_VERB] to get started

source: akajaiko
en: [GENERAL_NOUN] passion for roaming

source: obujaiko
en: [GENERAL_NOUN_PLURAL] passion for roamings

source: akajangu
en: [COMMON_ANIMALS_NOUN] small or beautiful cat

source: obujangu
en: [COMMON_ANIMALS_NOUN_PLURAL] small or beautiful cats

source: akanyamukara
en: [GENERAL_NOUN] nut grass

source: obunyamukara
en: [GENERAL_NOUN_PLURAL] nut grasses

source: akajanja
en: [GENERAL_NOUN] superficial behaviour

source: orujanja
en: [GENERAL_NOUN_PLURAL] superficial behaviours

source: akanyamukira
en: [GENERAL_NOUN] dung maggot

source: ombunyamukira
en: [GENERAL_NOUN_PLURAL] dung maggots

source: akanyamuniini
en: [COMMON_ANIMALS_NOUN] a fresh fried grasshopper

source: aktindinda
en: [GENERAL_NOUN] small snail

source: obutindinda
en: [GENERAL_NOUN_PLURAL] small snails

source: akanyamurera
en: [ART_AND_ENTERTAINMENT_NOUN] flute: a musical instrument

source: obunyamurere
en: [ART_AND_ENTERTAINMENT_NOUN_PLURAL] flute: a musical instruments

source: akanyamwenyi
en: [COMMON_ANIMALS_NOUN] squirrel

source: obunyamwenyi
en: [COMMON_ANIMALS_NOUN_PLURAL] squirrels

source: ekyena kye'kitoke
en: [GENERAL_NOUN] an undeveloped banana

source: ebyabana bye'bitoke
en: [GENERAL_NOUN_PLURAL] undeveloped bananas

source: ambuurra
en: [GENERAL_VERB] to exercise, remove evil

source: amiirra
en: [GENERAL_VERB] to call a bud

source: kwamira
en: [GENERAL_VERB] to shout at

source: kujokoza
en: [GENERAL_NOUN] continuous disturbance or provocation

source: akanyuunyarume
en: [NATURE_AND_ENVIRONMENT_NOUN] shrub eaten by goats

source: obunyuunyarume
en: [NATURE_AND_ENVIRONMENT_NOUN_PLURAL] shrub eaten by goatses

source: akanywanisa
en: [GENERAL_NOUN]: hyphen

source: obunywanisa
en: [GENERAL_NOUN_PLURAL]: hyphens

source: akanywero
en: [GENERAL_NOUN]:a very tight cloth

source: obunyero
en: [GENERAL_NOUN_PLURAL]:a very tight cloths

source: akaradaari
en: [GENERAL_NOUN]:mustard seed

source: obukaradaari
en: [GENERAL_NOUN_PLURAL]:mustard seeds

source: akaragwa
en: [GENERAL_NOUN]:inherited trait

source: oburagwa
en: [GENERAL_NOUN_PLURAL]:inherited traits

source: akarande
en: [GENERAL_NOUN]:inherited character or trait

source: oburandaine
en: [GENERAL_NOUN_PLURAL]:inherited character or traits

source: akarebure
en: [GENERAL_NOUN]:a slunderous utterance

source: oburebure
en: [GENERAL_NOUN_PLURAL]:a slunderous utterances

source: akasirimuko
en: [GENERAL_NOUN]: a steep slope

source: obusirimuko
en: [GENERAL_NOUN_PLURAL]: a steep slopes

source: muyaye
en: [GENERAL_NOUN]:sarcasm

source: obuyaye
en: [GENERAL_NOUN_PLURAL]:sarcasms

source: kwaka
en: [GENERAL_NOUN]:lust for sex

source: kwagura
en: [GENERAL_VERB] to scratch the body

source: akatiko
en: [GENERAL_NOUN]:peer pressure

source: obutiko
en: [GENERAL_NOUN_PLURAL]:peer pressures

source: akarondo
en: [GENERAL_NOUN]:lineage

source: oburondo
en: [GENERAL_NOUN_PLURAL]:lineages

source: akarungi
en: [GENERAL_NOUN]:something good, or beautiful

source: ebirungi
en: [GENERAL_NOUN_PLURAL]:something good, or beautifuls

source: akarwariro
en: [HEALTH_AND_MEDICINE_NOUN]:a clinic

source: oburwaro
en: [HEALTH_AND_MEDICINE_NOUN_PLURAL]:a clinics

source: akashuumo
en: [GENERAL_NOUN]:.a steep slope

source: akakokomoko
en: [GENERAL_NOUN_PLURAL]:.a steep slopes

source: akatima
en: [TRANSPORT_NOUN]:valve for a tyre

source: obutima
en: [TRANSPORT_NOUN_PLURAL]:valve for a tyres

source: akasisira
en: [GENERAL_NOUN]:a small hut

source: obusisira
en: [GENERAL_NOUN_PLURAL]:a small huts

source: akaveera
en: [GENERAL_NOUN]:plastic sheeting

source: obuvera
en: [GENERAL_NOUN_PLURAL]:plastic sheetings

source: allah
en: [GENERAL_NOUN]:God in Islamic religion

source: amaarwa
en: [GENERAL_NOUN]:beer: an alcoholic drink

source: amabere ge'mbwa
en: [COMMON_ANIMALS_NOUN]: dog teats

source: amadaraka
en: [GENERAL_NOUN]:being stylish

source: amafaranga
en: [ECONOMICS_AND_COMMERCE_NOUN]:Rwandese currency

source: makune
en: [GENERAL_NOUN]: hospitable people

source: eraama
en: [GENERAL_NOUN]:spots

source: obutabaijuko
en: [GENERAL_NOUN]:conflicts, intrigues, etc

source: ebisoko
en: [GENERAL_NOUN]:first leaves of beans

source: ebikarakate
en: [GENERAL_NOUN] ish scales

source: esande
en: [GENERAL_NOUN] undiluted banana juice.)

source: amakuute
en: [GENERAL_NOUN] neighbouring countries)

source: amakwenkwe
en: [GENERAL_NOUN] a hearty laugh

source: amacande
en: [GENERAL_NOUN] sunflower)

source: amamera
en: [GENERAL_NOUN] germinated plants

source: enyugunyu
en: [GENERAL_NOUN] pelvic bones

source: amaranga gi'zoba
en: [GENERAL_NOUN] rays of the sun

source: ekitungutana
en: [GENERAL_NOUN] sweating profusely

source: ebika bye'nkyanzi
en: [GENERAL_NOUN] type of beads

source: amaizi aga kufuka
en: [GENERAL_NOUN] water;cold water

source: amasa
en: [GENERAL_NOUN] nothing, emptiness

source: ebisansa
en: [GENERAL_NOUN].dry banana leaves

source: amasanyarazi
en: [TECHNOLOGY_NOUN]. Electricity

source: amasereka
en: [GENERAL_NOUN] breastmilk

source: amasobe
en: [COMMON_ANIMALS_NOUN]. A cat's dung

source: ebisodo
en: [GENERAL_NOUN] bird's droppings

source: amasununu
en: [GENERAL_NOUN] fresh milk

source: amasya
en: [GENERAL_NOUN] burns

source: amaizi aga kwokya
en: [GENERAL_NOUN] hot water

source: entangatangano
en: [GENERAL_NOUN] a road junction

source: amatembero
en: [GENERAL_NOUN] steps, or staircases

source: amaterekero
en: [GENERAL_NOUN] shelves

source: amatone
en: [GENERAL_NOUN] dots or spots

source: kunihira
en: [GENERAL_NOUN] expectancy, suspense, uncertaint

source: abarongo
en: [GENERAL_NOUN] identical twins

source: amazina
en: [GENERAL_NOUN] dancing styles

source: nangwa
en: [GENERAL_NOUN] no: a negative response

source: ibale lyo'muhendo
en: [GENERAL_NOUN] precious stone

source: ekiro kyo'kutemba mwiguru
en: [GENERAL_NOUN] Ascension Day

source: asidi
en: [CHEMISTRY_NOUN] acid

source: kasisira
en: [GENERAL_NOUN] small hut

source: akakaikuru kamu
en: [MATHEMATICS_NOUN] one million

source: akakekeeyo/ akasenginjo
en: [GENERAL_NOUN] a sieve

source: obukekeyo/ obusenginjo
en: [GENERAL_NOUN_PLURAL] sieves

source: akakongoijo
en: [GENERAL_NOUN] heel

source: obukongoijo
en: [GENERAL_NOUN_PLURAL] heels

source: akakonkomoko
en: [GENERAL_NOUN] slope

source: obukokomoko
en: [GENERAL_NOUN_PLURAL] slopes

source: akakunukizi
en: [GENERAL_NOUN] apostrophe

source: obukunukizi
en: [GENERAL_NOUN_PLURAL] apostrophes

source: karandaranda
en: [NATURE_AND_ENVIRONMENT_NOUN] a creeping plant

source: kurandaranda
en: [NATURE_AND_ENVIRONMENT_NOUN_PLURAL] creeping plants

source: akalebule
en: [GENERAL_NOUN] a careless talk

source: obulebule
en: [GENERAL_NOUN_PLURAL] careless talks

source: akalebulebu
en: [GENERAL_NOUN] difficult times

source: akaleecu
en: [GENERAL_NOUN] some peace

source: obuleecu
en: [GENERAL_NOUN_PLURAL] some peaces

source: akaregete
en: [GENERAL_NOUN] small packet

source: oburegete
en: [GENERAL_NOUN_PLURAL] small packets

source: akaleju
en: [GENERAL_NOUN] chin

source: obuleju
en: [GENERAL_NOUN_PLURAL] chins

source: akalenge
en: [GENERAL_NOUN] thin leg

source: obulenge
en: [GENERAL_NOUN_PLURAL] thin legs

source: akamaganda
en: [GENERAL_NOUN] tangerine

source: obumaganda
en: [GENERAL_NOUN_PLURAL] tangerines

source: akamanyiso/akarorwaho
en: [GENERAL_NOUN] sign

source: obumanyiso/oburorwaho
en: [GENERAL_NOUN_PLURAL] signs

source: kame
en: [COMMON_ANIMALS_NOUN] hare

source: obume
en: [COMMON_ANIMALS_NOUN_PLURAL] hares

source: akameeza
en: [GENERAL_NOUN] stool,lockable desk

source: obumeza
en: [GENERAL_NOUN_PLURAL] stool,lockable desks

source: akamogo
en: [GENERAL_NOUN] a mark,a scar

source: obumogo
en: [GENERAL_NOUN_PLURAL] mark,a scars

source: akanenero
en: [COMMON_ANIMALS_NOUN] a chick-bone

source: obunenero
en: [COMMON_ANIMALS_NOUN_PLURAL] chick-bones

source: akaniini
en: [GENERAL_NOUN] finely ground millet flour

source: obuniini
en: [GENERAL_NOUN_PLURAL] finely ground millet flours

source: akanwa
en: [GENERAL_NOUN] mouth

source: obunwa
en: [GENERAL_NOUN_PLURAL] mouths

source: akanyamankogoto
en: [COMMON_ANIMALS_NOUN] tortoise

source: obunyamankogoto
en: [COMMON_ANIMALS_NOUN_PLURAL] tortoises

source: akanyamuryaine
en: [GENERAL_NOUN] tumult, uproar

source: obunyamuryaine
en: [GENERAL_NOUN_PLURAL] tumult, uproars

source: ekika kyakatuzi
en: [GENERAL_NOUN] type of mushroom

source: ebika byo'butuzi
en: [GENERAL_NOUN_PLURAL] type of mushrooms

source: akatuzi ko'bwera
en: [GENERAL_NOUN] small white mushroom

source: obutuzi byo'bwera
en: [GENERAL_NOUN_PLURAL] small white mushrooms
